slorquet/slos/arch/armv7m/stm32l4/bits/stm32l4_periphs.h
#ifndef _ARCH_ARMV7M_STM32L4_BITS_STM32L4_PERIPHS_H_
#define _ARCH_ARMV7M_STM32L4_BITS_STM32L4_PERIPHS_H_

#define STM32L4_REGBASE_USRFLASH 0x08000000
#define STM32L4_REGBASE_SYSFLASH 0x1FFF0000

/* APB1 */
#define STM32L4_REGBASE_TIM2     0x40000000
#define STM32L4_REGBASE_TIM3     0x40000400
#define STM32L4_REGBASE_TIM4     0x40000800
#define STM32L4_REGBASE_TIM5     0x40000c00
#define STM32L4_REGBASE_TIM6     0x40001000
#define STM32L4_REGBASE_TIM7     0x40001400
#define STM32L4_REGBASE_LCD      0x40002400
#define STM32L4_REGBASE_RTC      0x40002800
#define STM32L4_REGBASE_WWDG     0x40002c00
#define STM32L4_REGBASE_IWDG     0x40003000
#define STM32L4_REGBASE_SPI2     0x40003800
#define STM32L4_REGBASE_SPI3     0x40003c00
#define STM32L4_REGBASE_USART2   0x40004400
#define STM32L4_REGBASE_USART3   0x40004800
#define STM32L4_REGBASE_UART4    0x40004c00
#define STM32L4_REGBASE_UART5    0x40005000
#define STM32L4_REGBASE_I2C1     0x40005400
#define STM32L4_REGBASE_I2C2     0x40005800
#define STM32L4_REGBASE_I2C3     0x40005c00
#define STM32L4_REGBASE_CAN1     0x40006400
#define STM32L4_REGBASE_PWR      0x40007000
#define STM32L4_REGBASE_DAC1     0x40007400
#define STM32L4_REGBASE_OPAMP    0x40007800
#define STM32L4_REGBASE_LPTIM1   0x40007c00
#define STM32L4_REGBASE_LPUART1  0x40008000
#define STM32L4_REGBASE_SWPMI1   0x40008800
#define STM32L4_REGBASE_LPTIM2   0x40009400

/* APB2 */
#define STM32L4_REGBASE_SYSCFG   0x40010000
#define STM32L4_REGBASE_VREFBUF  0x40010030
#define STM32L4_REGBASE_COMP     0x40010200
#define STM32L4_REGBASE_EXTI     0x40010400
#define STM32L4_REGBASE_FIREWALL 0x40011c00
#define STM32L4_REGBASE_SDMMC1   0x40012800
#define STM32L4_REGBASE_TIM1     0x40012c00
#define STM32L4_REGBASE_SPI1     0x40013000
#define STM32L4_REGBASE_TIM8     0x40013400
#define STM32L4_REGBASE_USART1   0x40013800
#define STM32L4_REGBASE_TIM15    0x40014000
#define STM32L4_REGBASE_TIM16    0x40014400
#define STM32L4_REGBASE_TIM17    0x40014800
#define STM32L4_REGBASE_SAI1     0x40014c00
#define STM32L4_REGBASE_SAI2     0x40015800
#define STM32L4_REGBASE_DFSDM1   0x40016000

/* AHB1 */
#define STM32L4_REGBASE_DMA1     0x40020000
#define STM32L4_REGBASE_DMA2     0x40020400
#define STM32L4_REGBASE_RCC	 0x40021000
#define STM32L4_REGBASE_FLASH    0x40022000
#define STM32L4_REGBASE_CRC      0x40023000
#define STM32L4_REGBASE_TSC      0x40024000

/* AHB2 */
#define STM32L4_REGBASE_GPIOA    0x48000000
#define STM32L4_REGBASE_GPIOB    0x48000400
#define STM32L4_REGBASE_GPIOC    0x48000800
#define STM32L4_REGBASE_GPIOD    0x48000c00
#define STM32L4_REGBASE_GPIOE    0x48001000
#define STM32L4_REGBASE_GPIOF    0x48001400
#define STM32L4_REGBASE_GPIOG    0x48001800
#define STM32L4_REGBASE_GPIOH    0x48001c00
#define STM32L4_REGBASE_OTGFS    0x50000000
#define STM32L4_REGBASE_ADC      0x50040000
#define STM32L4_REGBASE_AES      0x50040400
#define STM32L4_REGBASE_RNG      0x50060000

#endif /* _ARCH_ARMV7M_STM32L4_BITS_STM32L4_PERIPHS_H_ */

